import PerfectPower.MichorGeometry
set_option maxHeartbeats 5000000
set_option maxRecDepth 10000
namespace PerfectPower.CheckedDifferential.D9bd3b2918fbcdcdbfae62dd0ad17d6d9f44a45e409ff6cc546ee72ef3958c7e3
theorem log_gradient_0_denominator (x y : ℝ) : 2*(((4 : ℝ)))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8)))))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*((((((8 : ℝ)) + ((24 : ℝ)*(y)^2)) + (((24 : ℝ)*(y)^4) + (((8 : ℝ)*(y)^6) + ((24 : ℝ)*(x)^2)))) + ((((48 : ℝ)*(x)^2*(y)^2) + ((24 : ℝ)*(x)^2*(y)^4)) + (((24 : ℝ)*(x)^4) + (((24 : ℝ)*(x)^4*(y)^2) + ((8 : ℝ)*(x)^6)))))) := by ring
#print axioms log_gradient_0_denominator
theorem log_gradient_0_numerator (x y : ℝ) : 2*((0 : ℝ))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8))))))-(((4 : ℝ)))*((((((8 : ℝ)*(x)^1) + ((24 : ℝ)*(x)^1*(y)^2)) + (((24 : ℝ)*(x)^1*(y)^4) + (((8 : ℝ)*(x)^1*(y)^6) + ((24 : ℝ)*(x)^3)))) + ((((48 : ℝ)*(x)^3*(y)^2) + ((24 : ℝ)*(x)^3*(y)^4)) + (((24 : ℝ)*(x)^5) + (((24 : ℝ)*(x)^5*(y)^2) + ((8 : ℝ)*(x)^7)))))) = (((-4 : ℝ)*(x)^1))*((((((8 : ℝ)) + ((24 : ℝ)*(y)^2)) + (((24 : ℝ)*(y)^4) + (((8 : ℝ)*(y)^6) + ((24 : ℝ)*(x)^2)))) + ((((48 : ℝ)*(x)^2*(y)^2) + ((24 : ℝ)*(x)^2*(y)^4)) + (((24 : ℝ)*(x)^4) + (((24 : ℝ)*(x)^4*(y)^2) + ((8 : ℝ)*(x)^6)))))) := by ring
#print axioms log_gradient_0_numerator
theorem log_gradient_0 (x y : ℝ) : (((-4 : ℝ)*(x)^1))*(2*(((4 : ℝ)))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8)))))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(2*((0 : ℝ))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8))))))-(((4 : ℝ)))*((((((8 : ℝ)*(x)^1) + ((24 : ℝ)*(x)^1*(y)^2)) + (((24 : ℝ)*(x)^1*(y)^4) + (((8 : ℝ)*(x)^1*(y)^6) + ((24 : ℝ)*(x)^3)))) + ((((48 : ℝ)*(x)^3*(y)^2) + ((24 : ℝ)*(x)^3*(y)^4)) + (((24 : ℝ)*(x)^5) + (((24 : ℝ)*(x)^5*(y)^2) + ((8 : ℝ)*(x)^7))))))) :=
  PerfectPower.MichorGeometry.factor_clears (2*((0 : ℝ))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8))))))-(((4 : ℝ)))*((((((8 : ℝ)*(x)^1) + ((24 : ℝ)*(x)^1*(y)^2)) + (((24 : ℝ)*(x)^1*(y)^4) + (((8 : ℝ)*(x)^1*(y)^6) + ((24 : ℝ)*(x)^3)))) + ((((48 : ℝ)*(x)^3*(y)^2) + ((24 : ℝ)*(x)^3*(y)^4)) + (((24 : ℝ)*(x)^5) + (((24 : ℝ)*(x)^5*(y)^2) + ((8 : ℝ)*(x)^7))))))) (2*(((4 : ℝ)))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8))))))) (((-4 : ℝ)*(x)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) ((((((8 : ℝ)) + ((24 : ℝ)*(y)^2)) + (((24 : ℝ)*(y)^4) + (((8 : ℝ)*(y)^6) + ((24 : ℝ)*(x)^2)))) + ((((48 : ℝ)*(x)^2*(y)^2) + ((24 : ℝ)*(x)^2*(y)^4)) + (((24 : ℝ)*(x)^4) + (((24 : ℝ)*(x)^4*(y)^2) + ((8 : ℝ)*(x)^6))))))
    (log_gradient_0_denominator x y) (log_gradient_0_numerator x y)
theorem log_hessian_0_0_denominator (x y : ℝ) : ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2 = (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(((1 : ℝ))) := by ring
#print axioms log_hessian_0_0_denominator
theorem log_hessian_0_0_numerator (x y : ℝ) : (((-4 : ℝ)))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(x)^1))*(((2 : ℝ)*(x)^1)) = ((((-4 : ℝ)) + (((-4 : ℝ)*(y)^2) + ((4 : ℝ)*(x)^2))))*(((1 : ℝ))) := by ring
#print axioms log_hessian_0_0_numerator
theorem log_hessian_0_0 (x y : ℝ) : ((((-4 : ℝ)) + (((-4 : ℝ)*(y)^2) + ((4 : ℝ)*(x)^2))))*(((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2)=(((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*((((-4 : ℝ)))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(x)^1))*(((2 : ℝ)*(x)^1))) :=
  PerfectPower.MichorGeometry.factor_clears ((((-4 : ℝ)))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(x)^1))*(((2 : ℝ)*(x)^1))) (((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2) ((((-4 : ℝ)) + (((-4 : ℝ)*(y)^2) + ((4 : ℝ)*(x)^2)))) (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4))))) (((1 : ℝ)))
    (log_hessian_0_0_denominator x y) (log_hessian_0_0_numerator x y)
theorem log_hessian_0_1_denominator (x y : ℝ) : ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2 = (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(((1 : ℝ))) := log_hessian_0_0_denominator x y
#print axioms log_hessian_0_1_denominator
theorem log_hessian_0_1_numerator (x y : ℝ) : ((0 : ℝ))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(x)^1))*(((2 : ℝ)*(y)^1)) = (((8 : ℝ)*(x)^1*(y)^1))*(((1 : ℝ))) := by ring
#print axioms log_hessian_0_1_numerator
theorem log_hessian_0_1 (x y : ℝ) : (((8 : ℝ)*(x)^1*(y)^1))*(((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2)=(((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(((0 : ℝ))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(x)^1))*(((2 : ℝ)*(y)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (((0 : ℝ))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(x)^1))*(((2 : ℝ)*(y)^1))) (((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2) (((8 : ℝ)*(x)^1*(y)^1)) (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4))))) (((1 : ℝ)))
    (log_hessian_0_1_denominator x y) (log_hessian_0_1_numerator x y)
theorem log_gradient_1_denominator (x y : ℝ) : 2*(((4 : ℝ)))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8)))))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*((((((8 : ℝ)) + ((24 : ℝ)*(y)^2)) + (((24 : ℝ)*(y)^4) + (((8 : ℝ)*(y)^6) + ((24 : ℝ)*(x)^2)))) + ((((48 : ℝ)*(x)^2*(y)^2) + ((24 : ℝ)*(x)^2*(y)^4)) + (((24 : ℝ)*(x)^4) + (((24 : ℝ)*(x)^4*(y)^2) + ((8 : ℝ)*(x)^6)))))) := log_gradient_0_denominator x y
#print axioms log_gradient_1_denominator
theorem log_gradient_1_numerator (x y : ℝ) : 2*((0 : ℝ))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8))))))-(((4 : ℝ)))*((((((8 : ℝ)*(y)^1) + ((24 : ℝ)*(y)^3)) + (((24 : ℝ)*(y)^5) + (((8 : ℝ)*(y)^7) + ((24 : ℝ)*(x)^2*(y)^1)))) + ((((48 : ℝ)*(x)^2*(y)^3) + ((24 : ℝ)*(x)^2*(y)^5)) + (((24 : ℝ)*(x)^4*(y)^1) + (((24 : ℝ)*(x)^4*(y)^3) + ((8 : ℝ)*(x)^6*(y)^1)))))) = (((-4 : ℝ)*(y)^1))*((((((8 : ℝ)) + ((24 : ℝ)*(y)^2)) + (((24 : ℝ)*(y)^4) + (((8 : ℝ)*(y)^6) + ((24 : ℝ)*(x)^2)))) + ((((48 : ℝ)*(x)^2*(y)^2) + ((24 : ℝ)*(x)^2*(y)^4)) + (((24 : ℝ)*(x)^4) + (((24 : ℝ)*(x)^4*(y)^2) + ((8 : ℝ)*(x)^6)))))) := by ring
#print axioms log_gradient_1_numerator
theorem log_gradient_1 (x y : ℝ) : (((-4 : ℝ)*(y)^1))*(2*(((4 : ℝ)))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8)))))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(2*((0 : ℝ))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8))))))-(((4 : ℝ)))*((((((8 : ℝ)*(y)^1) + ((24 : ℝ)*(y)^3)) + (((24 : ℝ)*(y)^5) + (((8 : ℝ)*(y)^7) + ((24 : ℝ)*(x)^2*(y)^1)))) + ((((48 : ℝ)*(x)^2*(y)^3) + ((24 : ℝ)*(x)^2*(y)^5)) + (((24 : ℝ)*(x)^4*(y)^1) + (((24 : ℝ)*(x)^4*(y)^3) + ((8 : ℝ)*(x)^6*(y)^1))))))) :=
  PerfectPower.MichorGeometry.factor_clears (2*((0 : ℝ))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8))))))-(((4 : ℝ)))*((((((8 : ℝ)*(y)^1) + ((24 : ℝ)*(y)^3)) + (((24 : ℝ)*(y)^5) + (((8 : ℝ)*(y)^7) + ((24 : ℝ)*(x)^2*(y)^1)))) + ((((48 : ℝ)*(x)^2*(y)^3) + ((24 : ℝ)*(x)^2*(y)^5)) + (((24 : ℝ)*(x)^4*(y)^1) + (((24 : ℝ)*(x)^4*(y)^3) + ((8 : ℝ)*(x)^6*(y)^1))))))) (2*(((4 : ℝ)))*((((((1 : ℝ)) + (((4 : ℝ)*(y)^2) + ((6 : ℝ)*(y)^4))) + ((((4 : ℝ)*(y)^6) + ((1 : ℝ)*(y)^8)) + (((4 : ℝ)*(x)^2) + ((12 : ℝ)*(x)^2*(y)^2)))) + (((((12 : ℝ)*(x)^2*(y)^4) + ((4 : ℝ)*(x)^2*(y)^6)) + (((6 : ℝ)*(x)^4) + ((12 : ℝ)*(x)^4*(y)^2))) + ((((6 : ℝ)*(x)^4*(y)^4) + ((4 : ℝ)*(x)^6)) + (((4 : ℝ)*(x)^6*(y)^2) + ((1 : ℝ)*(x)^8))))))) (((-4 : ℝ)*(y)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) ((((((8 : ℝ)) + ((24 : ℝ)*(y)^2)) + (((24 : ℝ)*(y)^4) + (((8 : ℝ)*(y)^6) + ((24 : ℝ)*(x)^2)))) + ((((48 : ℝ)*(x)^2*(y)^2) + ((24 : ℝ)*(x)^2*(y)^4)) + (((24 : ℝ)*(x)^4) + (((24 : ℝ)*(x)^4*(y)^2) + ((8 : ℝ)*(x)^6))))))
    (log_gradient_1_denominator x y) (log_gradient_1_numerator x y)
theorem log_hessian_1_0_denominator (x y : ℝ) : ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2 = (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(((1 : ℝ))) := log_hessian_0_0_denominator x y
#print axioms log_hessian_1_0_denominator
theorem log_hessian_1_0_numerator (x y : ℝ) : ((0 : ℝ))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(y)^1))*(((2 : ℝ)*(x)^1)) = (((8 : ℝ)*(x)^1*(y)^1))*(((1 : ℝ))) := by ring
#print axioms log_hessian_1_0_numerator
theorem log_hessian_1_0 (x y : ℝ) : (((8 : ℝ)*(x)^1*(y)^1))*(((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2)=(((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(((0 : ℝ))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(y)^1))*(((2 : ℝ)*(x)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (((0 : ℝ))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(y)^1))*(((2 : ℝ)*(x)^1))) (((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2) (((8 : ℝ)*(x)^1*(y)^1)) (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4))))) (((1 : ℝ)))
    (log_hessian_1_0_denominator x y) (log_hessian_1_0_numerator x y)
theorem log_hessian_1_1_denominator (x y : ℝ) : ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2 = (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(((1 : ℝ))) := log_hessian_0_0_denominator x y
#print axioms log_hessian_1_1_denominator
theorem log_hessian_1_1_numerator (x y : ℝ) : (((-4 : ℝ)))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(y)^1))*(((2 : ℝ)*(y)^1)) = ((((-4 : ℝ)) + (((4 : ℝ)*(y)^2) + ((-4 : ℝ)*(x)^2))))*(((1 : ℝ))) := by ring
#print axioms log_hessian_1_1_numerator
theorem log_hessian_1_1 (x y : ℝ) : ((((-4 : ℝ)) + (((4 : ℝ)*(y)^2) + ((-4 : ℝ)*(x)^2))))*(((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2)=(((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*((((-4 : ℝ)))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(y)^1))*(((2 : ℝ)*(y)^1))) :=
  PerfectPower.MichorGeometry.factor_clears ((((-4 : ℝ)))*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))-(((-4 : ℝ)*(y)^1))*(((2 : ℝ)*(y)^1))) (((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))^2) ((((-4 : ℝ)) + (((4 : ℝ)*(y)^2) + ((-4 : ℝ)*(x)^2)))) (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4))))) (((1 : ℝ)))
    (log_hessian_1_1_denominator x y) (log_hessian_1_1_numerator x y)
theorem connection_0_0_0_denominator (x y : ℝ) : 2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(((2 : ℝ))) := by ring
#print axioms connection_0_0_0_denominator
theorem connection_0_0_0_numerator (x y : ℝ) : 1*(((-4 : ℝ)*(x)^1)) = (((-2 : ℝ)*(x)^1))*(((2 : ℝ))) := by ring
#print axioms connection_0_0_0_numerator
theorem connection_0_0_0 (x y : ℝ) : (((-2 : ℝ)*(x)^1))*(2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(1*(((-4 : ℝ)*(x)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (1*(((-4 : ℝ)*(x)^1))) (2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))) (((-2 : ℝ)*(x)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) (((2 : ℝ)))
    (connection_0_0_0_denominator x y) (connection_0_0_0_numerator x y)
theorem connection_0_0_1_denominator (x y : ℝ) : 2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(((2 : ℝ))) := connection_0_0_0_denominator x y
#print axioms connection_0_0_1_denominator
theorem connection_0_0_1_numerator (x y : ℝ) : 1*(((-4 : ℝ)*(y)^1)) = (((-2 : ℝ)*(y)^1))*(((2 : ℝ))) := by ring
#print axioms connection_0_0_1_numerator
theorem connection_0_0_1 (x y : ℝ) : (((-2 : ℝ)*(y)^1))*(2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(1*(((-4 : ℝ)*(y)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (1*(((-4 : ℝ)*(y)^1))) (2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))) (((-2 : ℝ)*(y)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) (((2 : ℝ)))
    (connection_0_0_1_denominator x y) (connection_0_0_1_numerator x y)
theorem connection_0_1_0_denominator (x y : ℝ) : 2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(((2 : ℝ))) := connection_0_0_0_denominator x y
#print axioms connection_0_1_0_denominator
theorem connection_0_1_0_numerator (x y : ℝ) : 1*(((-4 : ℝ)*(y)^1)) = (((-2 : ℝ)*(y)^1))*(((2 : ℝ))) := connection_0_0_1_numerator x y
#print axioms connection_0_1_0_numerator
theorem connection_0_1_0 (x y : ℝ) : (((-2 : ℝ)*(y)^1))*(2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(1*(((-4 : ℝ)*(y)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (1*(((-4 : ℝ)*(y)^1))) (2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))) (((-2 : ℝ)*(y)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) (((2 : ℝ)))
    (connection_0_1_0_denominator x y) (connection_0_1_0_numerator x y)
theorem connection_0_1_1_denominator (x y : ℝ) : 2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(((2 : ℝ))) := connection_0_0_0_denominator x y
#print axioms connection_0_1_1_denominator
theorem connection_0_1_1_numerator (x y : ℝ) : -1*(((-4 : ℝ)*(x)^1)) = (((2 : ℝ)*(x)^1))*(((2 : ℝ))) := by ring
#print axioms connection_0_1_1_numerator
theorem connection_0_1_1 (x y : ℝ) : (((2 : ℝ)*(x)^1))*(2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(-1*(((-4 : ℝ)*(x)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (-1*(((-4 : ℝ)*(x)^1))) (2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))) (((2 : ℝ)*(x)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) (((2 : ℝ)))
    (connection_0_1_1_denominator x y) (connection_0_1_1_numerator x y)
theorem connection_1_0_0_denominator (x y : ℝ) : 2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(((2 : ℝ))) := connection_0_0_0_denominator x y
#print axioms connection_1_0_0_denominator
theorem connection_1_0_0_numerator (x y : ℝ) : -1*(((-4 : ℝ)*(y)^1)) = (((2 : ℝ)*(y)^1))*(((2 : ℝ))) := by ring
#print axioms connection_1_0_0_numerator
theorem connection_1_0_0 (x y : ℝ) : (((2 : ℝ)*(y)^1))*(2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(-1*(((-4 : ℝ)*(y)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (-1*(((-4 : ℝ)*(y)^1))) (2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))) (((2 : ℝ)*(y)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) (((2 : ℝ)))
    (connection_1_0_0_denominator x y) (connection_1_0_0_numerator x y)
theorem connection_1_0_1_denominator (x y : ℝ) : 2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(((2 : ℝ))) := connection_0_0_0_denominator x y
#print axioms connection_1_0_1_denominator
theorem connection_1_0_1_numerator (x y : ℝ) : 1*(((-4 : ℝ)*(x)^1)) = (((-2 : ℝ)*(x)^1))*(((2 : ℝ))) := connection_0_0_0_numerator x y
#print axioms connection_1_0_1_numerator
theorem connection_1_0_1 (x y : ℝ) : (((-2 : ℝ)*(x)^1))*(2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(1*(((-4 : ℝ)*(x)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (1*(((-4 : ℝ)*(x)^1))) (2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))) (((-2 : ℝ)*(x)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) (((2 : ℝ)))
    (connection_1_0_1_denominator x y) (connection_1_0_1_numerator x y)
theorem connection_1_1_0_denominator (x y : ℝ) : 2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(((2 : ℝ))) := connection_0_0_0_denominator x y
#print axioms connection_1_1_0_denominator
theorem connection_1_1_0_numerator (x y : ℝ) : 1*(((-4 : ℝ)*(x)^1)) = (((-2 : ℝ)*(x)^1))*(((2 : ℝ))) := connection_0_0_0_numerator x y
#print axioms connection_1_1_0_numerator
theorem connection_1_1_0 (x y : ℝ) : (((-2 : ℝ)*(x)^1))*(2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(1*(((-4 : ℝ)*(x)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (1*(((-4 : ℝ)*(x)^1))) (2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))) (((-2 : ℝ)*(x)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) (((2 : ℝ)))
    (connection_1_1_0_denominator x y) (connection_1_1_0_numerator x y)
theorem connection_1_1_1_denominator (x y : ℝ) : 2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) = ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(((2 : ℝ))) := connection_0_0_0_denominator x y
#print axioms connection_1_1_1_denominator
theorem connection_1_1_1_numerator (x y : ℝ) : 1*(((-4 : ℝ)*(y)^1)) = (((-2 : ℝ)*(y)^1))*(((2 : ℝ))) := connection_0_0_1_numerator x y
#print axioms connection_1_1_1_numerator
theorem connection_1_1_1 (x y : ℝ) : (((-2 : ℝ)*(y)^1))*(2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))))=((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))*(1*(((-4 : ℝ)*(y)^1))) :=
  PerfectPower.MichorGeometry.factor_clears (1*(((-4 : ℝ)*(y)^1))) (2*((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2))))) (((-2 : ℝ)*(y)^1)) ((((1 : ℝ)) + (((1 : ℝ)*(y)^2) + ((1 : ℝ)*(x)^2)))) (((2 : ℝ)))
    (connection_1_1_1_denominator x y) (connection_1_1_1_numerator x y)
theorem curvature_x_denominator (x y : ℝ) : ((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))) = (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(((1 : ℝ))) := by ring
#print axioms curvature_x_denominator
theorem curvature_y_denominator (x y : ℝ) : ((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))) = (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(((1 : ℝ))) := curvature_x_denominator x y
#print axioms curvature_y_denominator
theorem curvature_times_density_denominator (x y : ℝ) : 2*(((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4))))) = (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(((2 : ℝ))) := by ring
#print axioms curvature_times_density_denominator
theorem curvature_times_density_numerator (x y : ℝ) : -(((((-4 : ℝ)) + (((-4 : ℝ)*(y)^2) + ((4 : ℝ)*(x)^2))))*(((1 : ℝ)))+((((-4 : ℝ)) + (((4 : ℝ)*(y)^2) + ((-4 : ℝ)*(x)^2))))*(((1 : ℝ)))) = (((4 : ℝ)))*(((2 : ℝ))) := by ring
#print axioms curvature_times_density_numerator
theorem curvature_times_density (x y : ℝ) : (((4 : ℝ)))*(2*(((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4))))))=(((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))*(-(((((-4 : ℝ)) + (((-4 : ℝ)*(y)^2) + ((4 : ℝ)*(x)^2))))*(((1 : ℝ)))+((((-4 : ℝ)) + (((4 : ℝ)*(y)^2) + ((-4 : ℝ)*(x)^2))))*(((1 : ℝ))))) :=
  PerfectPower.MichorGeometry.factor_clears (-(((((-4 : ℝ)) + (((-4 : ℝ)*(y)^2) + ((4 : ℝ)*(x)^2))))*(((1 : ℝ)))+((((-4 : ℝ)) + (((4 : ℝ)*(y)^2) + ((-4 : ℝ)*(x)^2))))*(((1 : ℝ))))) (2*(((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4)))))) (((4 : ℝ))) (((((1 : ℝ)) + (((2 : ℝ)*(y)^2) + ((1 : ℝ)*(y)^4))) + (((2 : ℝ)*(x)^2) + (((2 : ℝ)*(x)^2*(y)^2) + ((1 : ℝ)*(x)^4))))) (((2 : ℝ)))
    (curvature_times_density_denominator x y) (curvature_times_density_numerator x y)
#print axioms log_gradient_0
#print axioms log_gradient_1
#print axioms connection_0_0_0
#print axioms curvature_times_density
end PerfectPower.CheckedDifferential.D9bd3b2918fbcdcdbfae62dd0ad17d6d9f44a45e409ff6cc546ee72ef3958c7e3
